import random

def random_banners():
   banner1 = r"""
   ░█████████                         ░██                          
   ░██     ░██                        ░██                          
   ░██     ░██ ░██░████  ░███████  ░████████ ░██    ░██  ░███████  
   ░█████████  ░███     ░██    ░██    ░██    ░██    ░██ ░██        
   ░██         ░██      ░██    ░██    ░██    ░██    ░██  ░███████  
   ░██         ░██      ░██    ░██    ░██    ░██   ░███        ░██ 
   ░██         ░██       ░███████      ░████  ░█████░██  ░███████  
   """

   banner2 = r"""
   _______  _______  _______ _________          _______ 
   (  ____ )(  ____ )(  ___  )\__   __/|\     /|(  ____ \
   | (    )|| (    )|| (   ) |   ) (   | )   ( || (    \/
   | (____)|| (____)|| |   | |   | |   | |   | || (_____ 
   |  _____)|     __)| |   | |   | |   | |   | |(_____  )
   | (      | (\ (   | |   | |   | |   | |   | |      ) |
   | )      | ) \ \__| (___) |   | |   | (___) |/\____) |
   |/       |/   \__/(_______)   )_(   (_______)\_______)
   """

   banner3 = r"""
S> Can I take some cookies?
D> What's the magic word?
S> sudo!
   """

   banner4 = r"""
   $$$$$$$\                       $$\                         
   $$  __$$\                      $$ |                        
   $$ |  $$ | $$$$$$\   $$$$$$\ $$$$$$\   $$\   $$\  $$$$$$$\ 
   $$$$$$$  |$$  __$$\ $$  __$$\\_$$  _|  $$ |  $$ |$$  _____|
   $$  ____/ $$ |  \__|$$ /  $$ | $$ |    $$ |  $$ |\$$$$$$\  
   $$ |      $$ |      $$ |  $$ | $$ |$$\ $$ |  $$ | \____$$\ 
   $$ |      $$ |      \$$$$$$  | \$$$$  |\$$$$$$  |$$$$$$$  |
   \__|      \__|       \______/   \____/  \______/ \_______/ 
   """

   banner5 = r"""
    ______   ______    ______   _________  __  __   ______      
   /_____/\ /_____/\  /_____/\ /________/\/_/\/_/\ /_____/\     
   \:::_ \ \\:::_ \ \ \:::_ \ \\__.::.__\/\:\ \:\ \\::::_\/_    
    \:(_) \ \\:(_) ) )_\:\ \ \ \  \::\ \   \:\ \:\ \\:\/___/\   
     \: ___\/ \: __ `\ \\:\ \ \ \  \::\ \   \:\ \:\ \\_::._\:\  
      \ \ \    \ \ `\ \ \\:\_\ \ \  \::\ \   \:\_\:\ \ /____\:\ 
       \_\/     \_\/ \_\/ \_____\/   \__\/    \_____\/ \_____\/ 
   """
   banner6 = r"""
                    *****************
               ******               ******
           ****                           ****
        ****                                 ***
      ***                                       ***
     **           ***               ***           **
   **           *******           *******          ***
  **            *******           *******            **
 **             *******           *******             **
 **               ***               ***               **
**                                                     **
**       *                                     *       **
**      **                                     **      **
 **   ****                                     ****   **
 **      **                                   **      **
  **       ***                             ***       **
   ***       ****                       ****       ***
     **         ******             ******         **
      ***            ***************            ***
        ****                                 ****
           ****                           ****
               ******               ******
                    *****************
   - Smile, you might be being watched right now!
   """

   banner7 = r"""
    U dumbass, go use the Metasploit
            .   .
             \ /
           `/ ! \`
           | o:o |
          ~| o:o |~
          / \_:_/ \

    - a random insect
"""

   banner8 = r"""
      ___         ___           ___                         ___           ___     
     /\  \       /\  \         /\  \                       /\  \         /\__\    
    /::\  \     /::\  \       /::\  \         ___          \:\  \       /:/ _/_   
   /:/\:\__\   /:/\:\__\     /:/\:\  \       /\__\          \:\  \     /:/ /\  \  
  /:/ /:/  /  /:/ /:/  /    /:/  \:\  \     /:/  /      ___  \:\  \   /:/ /::\  \ 
 /:/_/:/  /  /:/_/:/__/___ /:/__/ \:\__\   /:/__/      /\  \  \:\__\ /:/_/:/\:\__\
 \:\/:/  /   \:\/:::::/  / \:\  \ /:/  /  /::\  \      \:\  \ /:/  / \:\/:/ /:/  /
  \::/__/     \::/~~/~~~~   \:\  /:/  /  /:/\:\  \      \:\  /:/  /   \::/ /:/  / 
   \:\  \      \:\~~\        \:\/:/  /   \/__\:\  \      \:\/:/  /     \/_/:/  /  
    \:\__\      \:\__\        \::/  /         \:\__\      \::/  /        /:/  /   
     \/__/       \/__/         \/__/           \/__/       \/__/         \/__/   
"""

   banner9 = r"""
 ______   ______     ______     ______   __  __     ______    
/\  == \ /\  == \   /\  __ \   /\__  _\ /\ \/\ \   /\  ___\   
\ \  _-/ \ \  __<   \ \ \/\ \  \/_/\ \/ \ \ \_\ \  \ \___  \  
 \ \_\    \ \_\ \_\  \ \_____\    \ \_\  \ \_____\  \/\_____\ 
  \/_/     \/_/ /_/   \/_____/     \/_/   \/_____/   \/_____/ 
                                                                 
"""
   banner10 = r"""
░▒▓███████▓▒░░▒▓███████▓▒░ ░▒▓██████▓▒░▒▓████████▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓███████▓▒░ 
░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░   ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        
░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░   ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        
░▒▓███████▓▒░░▒▓███████▓▒░░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░   ░▒▓█▓▒░░▒▓█▓▒░░▒▓██████▓▒░  
░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░   ░▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░ 
░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▒░   ░▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░ 
░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░░▒▓██████▓▒░  ░▒▓█▓▒░    ░▒▓██████▓▒░░▒▓███████▓▒░  
"""

   banner11 = r"""
                                                 ██████████░▒▒▒▒▒▒▒▒▒▒▒▒▒▒░                    
                                         ▓███████           ░░░░░░░░░░░▒                       
                                        ███ █     ░░░░░░░░░░░░░░░░░░▒░                     
                                      ▒          ░░░░░░░░░░░░░░░░░▒░                           
                                       ███  ████   ░░░░░░░░░░░░░▒░                             
                                     █████████████   ░░░░░░░░░▒   ░░░░░▒▒▓▓▓▓▒▒░               
                 ███               █████ █▓█ ░██████    ░░░░▒   ░░░░░           ▒▓             
                 ███              ████   ███     █████▓  ░░   ░░░░░░░░░░░░   ░▓░               
                ███              ██      ███        ░███ ░░▒░    ░░░░░░    ▒▒                  
                ███              ▒      ████          ██ ░░░░░▒▒        ▒▓                     
                 ██              █████░████ ░▓██████████ ░░░░░░░░▒▒▒  ▒                        
                 ██░           ▓  ███       ████████████░ ░░░░░░░░░░░░░░                       
            ████████ ███        ██              █      ▓  ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░                   
           ██████  ██████        ░█                  ██                 ░▒▒▒▓▓▓░               
          ▓█▓▓█ ▒████  █          █    ░██████      ██  ░░░░ ░░ ░░ ░░ ░░                       
           ██▓███                  █   █     ▒     ██░  ░░░                                    
            ████   ▒░░░░                           ██  ░░    ████████     ░                    
                         ▒          █  █      █    █       ░         ████                      
                ████████  ░           ▓ ██████   ▓▓█ ▒▒  █   ▒░   ▒▒░   ▒██                    
                 █▓▓▓▓▓██▓           ██         ▓▒█  ░░ ███▓ ░░░▒  ░▒    ▒█                    
                █████████             ██        ▓██ ░   █▓██ ░░░░▒       ▒█                    
                                       ██ ████ ███     ██▓▓█ ░░░░▒       ██                    
                         ███░      ▒███ ▒▒▓  ▓███   ▓███▓███ ░░░░▒ █ ▓██░█░                    
                            ████████              █████████  ░░░▒  █ ░▓  █ █                   
                                                      ▓▓    ░░    ███░      █                  
                                                    ░    ▒▒░   ██ ███████  ██                  
                                                  ░░         ▓████   ██                        
                                                   ░       ▒ ██▓▓███                           
                                                ░▒▓   ██   ░  ███▓█████                        
                                               ░▒░   █  █▒ ░░  ▓███ ░  █                       
                                                ▒▒▒▒  ▒ ██ ░▒                           -THE FUN NEVER ENDS!
                                                        ██ ░░                                  
                                                   █   ███ ░▒ ████                             
                                                   █ █ ▓         ▒█                            
                                                       ███▓██████▒                             
                                                       █████████ █                             
                                                        ████████                               
                                               ░░▒░ █████         ░░                           
                                      ░▒▒▒▒▒▒▒▒ ░░░   ██████ ░░   ░░░░▒▒░                      
                                   ▒▒░░░░░░  ░░░░░░░░   ████    ░░░   ░░░▒▒▒                   
                                   ▒▒▒░  ░░░░░░▒▒▒▒▒▒▒▒      ░     ░▒░░░░▒▒░                   
                                      ░▒▒▒▒░░░             ░░▒▒▒▒▓▓▒▒▒▒░                       
                                              ░░░░▒▒▒▒▒▒▒▒░░░                                                                                                       
"""
   banner12 = r"""
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ;;;;;;;;;;;ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÞÏ^^^^^^^^^^^^^^^^^^^JÞÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ+^^^^^^^^^ÆÆÆÆÆÆÆ^^^^^^^^^+ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ;^^^^^^^^^ÆÆÆÆÆÆÆÆÆ^^^^^^^^^;ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ+^^^^^^^^^^ÆÆÆÆÆÆÆÆÆ^^^^^^^^^^;ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ™^^^^^^^^   ^^^^^^^^^   ^^^^^^^^ÏÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ^^^^ ;^^^^^^^^^^^^^^^^^^^^^; ^^^^ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ^^ ^^^^                   ^^^^ ^^ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ   Þ™       ÆÆÆ       ™¶   ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ ÆÆ Æ™    ¶Æ¶                 ÞÆÅ    ÏÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ   ÆÆàÆÆÆÆÆÆ    gÆÆÆÆÆÆÆÅ    ÆÆÆÆÆÆ™ÆÆJ;ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ       =ÆÆÆÆ   ÆÆÆÆÆÆÆÆÆ   ÆÆÆÆJ     ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ              ÆÆ ÆÆÆÆÆÆÆÆÆ ÆÆ         Æ™ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ   ^^^;             ÆÆÆÆÆÆÆ             ^^^^   ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ™  ^^^^^^^^     ÆÆ         ;   ;         ÆÆ     ^^^^^^^^  ÏÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆ ;;^^^^^^ ;^^^^      ÆÆÆ Æà ÞÆ™ÆÆÆ ÆÆÆ™ÆÞ àÆ ÆÆÆ      ^^^^; ^^^^^^;; ÆÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆ^^^^^^;    ^^^^;       ÆÆµÆÆ ÆÆÆÆÆÆ ÆÆÆÆÆÆ ÆÆ™ÆÆ       ;^^^^    ;^^^^^;ÆÆÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆà^;;;        ^^^^        JÆÆ Æ ÆÆÅgÆÆ ÆÆÅgÆÆ Æ ÅÆÏ        ^^^^        ;;;^àÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÞ^^; ^         ^^^;         ¶Æ¶                 ÞÆÅ         ;^^^         ^ ;^^àÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆ+^^^            ^^^^           Æ¶                 ÞÆ           ^^^^            ^^^+ÆÆÆÆÆÆ
ÆÆÆÆÞ^^^^             ^^^^           ÆÆ                 ÆÆ           ^^^^             ^^^^µÆÆÆÆ
ÆÆÆÅ;^^               ^^^             Æ                 Æ             ^^^               ^^;gÆÆÆ
ÆÆÆ;^^          ;    ^^^^             Æ  Æ           Æ  Æ             ^^^^    ;;         ^^;ÆÆÆ
ÆÆ;^^^          ;    ^^^^;            ÆÆ ÆÆÆ=JJ JJ=ÆÆÆ ÆÆ             ^^^^    ;          ^^^;ÆÆ
Æ;^^^            ;   ^^^^              Æ ;ÆÆÆÆÆ ÆÆÆÆÆ^ Æ              ^^^^   ;;           ^^^;Æ
 ^^^             ;   ^^^^              ÆÆ   ÅÆÆ ÆÆÆ   ÆÆ              ^^^^   ;             ^^^ 
 ^^;              ^ ^^^^^;              ÆÆÆÆ       ÆÆÆÆ               ^^^^^ ^              ;^^ 
 ^^                ^^^^^^                ™ÆÆÆÆÆÆÆÆÆÆÆµ                ^^^^^^                ^^ 
Æ ^                 ^^^^^^                                           ^^^^^^                 ^ Æ
ÆÆÆ                ^^^^^^^                                           ^^^^^^^                ÆÆÆ
ÆÆÆÆÞ              ^^^^^^^^                                         ^^^^^^^^              µÆÆÆÆ
ÆÆÆÆÆÆ;;           ^^^^^^^^^^                                     ^^^^^^^^^^           ;;ÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆà;       ^^^^^^^^^^^^^;;;;;;;                 ;;;;;;;^^^^^^^^^^^^^        àÆÆÆÆÆÆÆÆÆÆ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
"""
   banner13 = r"""
              {}
             {{}}
             {{}}
              {}
            .-''-.
           /  __  \
          /.-'  '-.\
          \::.  .::/          Open your eyes.
           \'    '/           Open your mind.
      __ ___)    (___ __      There's something watching you
    .'   \\        //   `.
   /     | '-.__.-' |     \
   |     |  '::::'  |     |
   |    /    '::'    \    |
   |_.-;\     __     /;-._|
   \.'^`\\    \/    //`^'./
   /   _.-._ _||_ _.-._   \
  `\___\    '-..-'    /___/`
       /'---.  `\.---'\
      ||    |`\\\|    ||
      ||    | || |    ||
      |;.__.' || '.__.;|
      |       ||       |
      {{{{{{{{||}}}}}}}}
       |      ||      |
       |.-==-.||.-==-.|
       <.    .||.    .>
        \'=='/||\'=='/
        |   / || \   |
        |   | || |   |
        |   | || |   |
        /^^\| || |/^^\
       /   .' || '.   \
      /   /   ||   \   \
     (__.'    \/    '.__)

"""

   list_banners = [banner1, banner2, banner3, banner4, banner5, banner6, banner7, banner8, banner9, banner10, banner11, banner12, banner13]
   random_banner = random.choice(list_banners)
   print(random_banner)