#                    Welcome to Protus!
#
#   ░█████████                         ░██                          
#   ░██     ░██                        ░██                          
#   ░██     ░██ ░██░████  ░███████  ░████████ ░██    ░██  ░███████  
#   ░█████████  ░███     ░██    ░██    ░██    ░██    ░██ ░██        
#   ░██         ░██      ░██    ░██    ░██    ░██    ░██  ░███████  
#   ░██         ░██      ░██    ░██    ░██    ░██   ░███        ░██ 
#   ░██         ░██       ░███████      ░████  ░█████░██  ░███████  
#
#                   Developed by RetroGuy1336

from banners import random_banners

def main():
    random_banners()
    print("""
[ + ]     --[   Protus, Programmable Recon & Offensive Toolkit for Unified Systems   ]
[ + ] --  -=[   We currently lack an arsenal of offensive security tools :(          ]
[ + ] -  --=[   ---------------Developed by RetroGuy1336-----------------            ]""")
    user = input("pts >> ")


if __name__ == "__main__":
    main()